import chalk from "chalk";

const crabArt = `
⣿⣿⣿⣿⡿⠋⠁⠀⠀⠀⠹⣿⣿⣿⣿⣿⣿⣿⣿⠏⠀⠀⠀⠈⠙⢿⣿⣿⣿⣿
⣿⣿⣿⡟⠀⠀⠀⠀⠠⠀⠀⣿⣿⣿⣿⣿⣿⣿⣿⠀⠀⠄⠀⠀⠀⠀⢻⣿⣿⣿
⣿⣿⡟⠀⠀⠀⠀⠀⠀⠀⢀⣿⣿⣿⣿⣿⣿⣿⣿⡀⠀⠀⠀⠀⠀⠀⠀⢻⣿⣿
⣿⣿⡇⠀⠀⠀⠀⠀⠀⢀⣮⣿⣿⣿⣿⣿⣿⣿⣿⣵⡀⠀⠀⠀⠀⠀⠀⢸⣿⣿
⣿⣿⡀⠀⠀⠀⠀⢀⣴⣿⣯⡛⠋⠁⢻⡟⠈⠙⢛⣽⣿⣦⡀⠀⠀⠀⠀⢀⣿⣿
⣿⣿⡇⠀⠀⠀⢾⣿⠟⠋⠁⠀⠀⠀⠀⠀⠀⠀⠀⠈⠙⠻⣿⡷⠀⠀⠀⢸⣿⣿
⠛⠛⣷⡀⠀⠀⠈⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠁⠀⠀⢀⣾⠛⠛
⡀⠀⠈⠻⣶⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⣶⠟⠁⠀⢀
⣷⣄⣀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⣾
⠛⠛⠛⠶⠶⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠶⠶⠛⠛⠛
⣆⡀⠀⠀⠀⠀⢀⠄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠠⡀⠀⠀⠀⠀⢀⣰
⣿⣿⡿⠶⠚⠉⠀⠀⢀⠂⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠐⡀⠀⠀⠉⠓⠶⢿⣿⣿
⣿⠋⠀⠀⠀⠀⣠⡴⠋⠀⠀⣠⣶⣶⣶⣶⣶⣶⣄⠀⠀⠙⢦⣄⠀⠀⠀⠀⠙⣿
⣿⣿⣷⣾⣿⣿⣿⡇⠀⠀⢀⣿⣿⣿⣿⣿⣿⣿⣿⡀⠀⠀⢸⣿⣿⣿⣷⣾⣿⣿
⣿⣿⣿⣿⣿⣿⣿⣷⠀⠀⣸⣿⣿⣿⣿⣿⣿⣿⣿⣇⠀⠀⣾⣿⣿⣿⣿⣿⣿⣿
`;

export function holyCrab() {
  console.log(chalk.yellow("🦀May Holy Crab eliminate all of your bugs. 🦀"));
  console.log(crabArt);
  console.log(chalk.yellow("🦀May Holy Crab eliminate all of your bugs. 🦀"));
  console.log(chalk.bgGreen("Created by Tom Xu in Feb,2025"));
}
